Repository: Belarus/OmegaT-Common.TMX
Catalog: tmx/non-segmented/drupal-7.x.tmx
Source language: en
Languages: be

source: The Testing module provides a framework for running automated unit tests. It can be used to verify a working state of Drupal before and after any code changes, or as a means for developers to write and execute tests for their modules. For more information, see the online handbook entry for <a href="@simpletest">Testing module</a>.
be: Модуль Testing прадастаўляе фрэймворк для аўтаматычнага тэсціравання. Ён можа быць выкарыстаны для праверкі рабочага стану Drupal перад і пасля зменаў кода, або як сродак для распрацоўшчыкаў пісаць і выконваць тэсты для іх модуляў. Для атрымання большых звестак глядзіце анлайн дапаможнік <a href="@simpletest">модуля Testing</a>.

source: The Text module defines various text field types for the Field module. A text field may contain plain text only, or optionally, may use Drupal's <a href='@filter-help'>text filters</a> to securely manage HTML output. Text input fields may be either a single line (text field), multiple lines (text area), or for greater input control, a select box, checkbox, or radio buttons. If desired, the field can be validated, so that it is limited to a set of allowed values. See the <a href='@field-help'>Field module help page</a> for more information about fields.
be: Модуль Text вызначае розныя тыпы тэкставых палёў для модуля Field. Тэкставае поле можа ўтрымліваць толькі просты тэкст, ці апцыянальна, можа ўжываць <a href='@filter-help'>тэкставыя фільтры</a> Drupal, каб бяспечна кіраваць HTML высновамі. Палі ўводу тэксту могуць быць як у адзін радок (тэкставае поле), у некалькі радкоў (тэкставая вобласць), альбо, для большага ўваходнага кантролю, могуць ўтрымліваць выпадаючы спіс, пераключальнікі, ці радыё кнопкі. Пры жаданні, палі могуць быць правераны на абмежаванасць з наборам дапушчальных значэнняў. Глядзіце <a href='@field-help'> старонку даведкі модуля Field </ a> для атрымання дадатковай інфармацыі аб палях.

source: The Toolbar module displays a bar containing top-level administrative links across the top of the screen. Below that, the Toolbar module has a <em>drawer</em> section where it displays links provided by other modules, such as the core <a href="@shortcuts-help">Shortcut module</a>. The drawer can be hidden/shown by using the show/hide shortcuts link at the end of the toolbar.
be: Модуль Toolbar адлюстроўвае панэль ў версе экрана для адміністратарскіх спасылак. Ніжэй гэтага, модуль Toolbar мае секцыю-<em>шуфляду</em>, дзе адлюстроўваюцца спасылкі іншых модуляў, такіх як модуль ядра <a href="@shortcuts-help">Shortcut</a>. Шуфляда можа быць паказана/cхавана, выкарыстоўваючы камбінацыяй клавіш паказаць/схаваць у нізе панелі інструментаў.

source: The Toolbar module displays links to top-level administration menu items and links from other modules at the top of the screen. For more information, see the online handbook entry for <a href="@toolbar">Toolbar module</a>.
be: Модуль Toolbar адлюстроўвае спасылкі і элементы ў верхнім адміністратарскім меню з іншых модуляў (у верхняй часцы экрана). Для атрымання большых звестак глядзіце запісы анлайн дапаможніка для <a href="@toolbar">модуля Toolbar</a>.

source: The Tracker module adds a new menu item to the Navigation menu, called <em>Recent content</em>. You can configure menu items via the <a href="@menus">Menus administration page</a>.
be: Модуль Tracker дадае новы элемент меню ў Навігацыйнае меню, з назвай <em>Апошняе змесціва</em>. Вы можаце наладзіць элементы меню праз старонку <a href="@menus">Адміністравання меню</a>.

source: The Tracker module displays the most recently added and updated content on your site, and allows you to follow new content created by each user. This module has no configuration options. For more information, see the online handbook entry for <a href="@tracker">Tracker module</a>.
be: Модуль Tracker адлюстроўвае ўсё нядаўна дададзенае ці змененае змесціва на вашым сайце і дазваляе вам сачыць за новым змесцівам, якое створаецца карыстальнікамі. Гэты модуль не мае опцый наладак. Каб атрымаць дадатковую інфармацыю, глядзіце ў сеціўным дапаможніку <a href="@tracker">модуль Tracker</a>.

source: The Trigger module provides the ability to cause <em>actions</em> to run when certain <em>triggers</em> take place on your site. Triggers are events, such as new content being added to your site or a user logging in, and actions are tasks, such as unpublishing content or e-mailing an administrator. For more information, see the online handbook entry for <a href="@trigger">Trigger module</a>.
be: Модуль Trigger растлумачвае ўжыванне <em>дзеянняў</em>, калі на вашым сайце выкарыстоўваюцца пэўныя <em>трыгеры</em>. Трыгеры – падзеі на вашым сайце, напрыклад, даданне новага змесціва, або уваход карыстальніка. Дзеянні – гэта задачы, такія як: не апублікоўваць змесціва ці адпраўленне e-mail адміністратару. Для падрабязнай інфармацыі глядзіце анлайн даведнік <a href="@trigger">Trigger module</a>.

source: The URL %url is invalid.
be: Адрас %url няверны.

source: The URL %url is invalid. Enter a fully-qualified URL, such as http://www.example.com/feed.xml.
be: URL %url направільны. Увядзіце поўны URL, як, напрыклад, http://www.example.com/feed.xml.

source: The URL of the account edit page.
be: URL старонкі рэдагавання акаўнта

source: The URL of the account profile page.
be: URL профільнай старонкі акаўнта

source: The URL of the comment's edit page.
be: URL старонкі рэдагавання каментароў.

source: The URL of the comment.
be: URL каментара

source: The URL of the node's edit page.
be: URL вузлоў рэдагавання старонкі.

source: The URL of the node.
be: URL вузла.

source: The URL of the site's front page without the protocol.
be: URL галоўнай старонкі сайту без пратакола.

source: The URL of the site's front page.
be: URL галоўнай старонкі сайту.

source: The URL of the site's login page.
be: URL старонкі ўваходу на сайт.

source: The URL of the taxonomy term.
be: URL тэрміна таксанаміі

source: The URL of the view.
be: Спасылка віда.

source: The URL of your homepage is not valid. Remember that it must be fully qualified, i.e. of the form <code>http://example.com/directory</code>.
be: URL для вашай хатняй старонкі недапушчальны. Памятайце, што ён мусіць быць поўнасцю адпаведным, г. зн. формы <code>http://example.com/directory</code>.

source: The URL to which the user should be redirected. This can be an internal URL like node/1234 or an external URL like http://drupal.org.
be: URL,на які карыстальнік павінен быць перанакіраваны. Гэта можа быць унутраны URL, напрыклад, node/1234 ці знешні URL, як http://drupal.org.

source: The Update manager also allows administrators to update and install modules and themes through the administration interface.
be: Update Manager таксама дазваляе адміністратарам абнаўляць і ўсталёўваць модулі і тэмы праз інтэрфейс адміністравання.

source: The Update manager module allows administrators to perform updates directly through the administration interface. At the top of the <a href="@modules_page">modules</a> and <a href="@themes_page">themes</a> pages you will see a link to update to new releases. This will direct you to the <a href="@update-page">update page</a> where you see a listing of all the missing updates and confirm which ones you want to upgrade. From there, you are prompted for your FTP/SSH password, which then transfers the files into your Drupal installation, overwriting your old files. More detailed instructions can be found in the <a href="@update">online handbook</a>.
be: Модуль Update manager дазваляе адміністратарам рабіць аднаўленні напрамую выкарыстоўваючы адміністратарскі інтэрфейс. Уверсе старонак <a href="@modules_page">модуляў</a> і <a href="@themes_page">тэмаў</a> вы будзеце бачыць спасылку на новыя рэлізы. Яна будзе весці вас на <a href="@update-page">старонку абнаўленняў</a>, дзе вы ўбачыце спіс усіх прапушчаных аднаўленняў і можаце прыняць тыя, якія пажадаеце абнавіць. Там вас запытаюць ваш FTP/SSH пароль, які затым перадасць файлы ў вашу Drupal інсталяцыю і перакрые старыя файлы. Больш дэталёвыя інструкцыі могуць быць знойдзены ў <a href="@update">анлайн дапаможніку</a>.

source: The Update manager module periodically checks for new versions of your site's software (including contributed modules and themes), and alerts administrators to available updates. In order to provide update information, anonymous usage statistics are sent to Drupal.org. If desired, you may disable the Update manager module from the <a href='@modules'>Module administration page</a>. For more information, see the online handbook entry for <a href='@update'>Update manager module</a>.
be: Модуль Update manager перыядычна правярае новыя версіі модуляў, тэмаў на вашым сайце і паведамляе адміністратарам аб даступных абнаўленнях. Таксама для таго, каб аднавіць інфармацыю ананімнай статыстыкі выкарыстання модуля, ці тэмы на Drupal.org.\r \r Па жаданню вы можаце адключыць Модуль Update manager на старонцы <a href='@modules'>адміністравання модуляў</a>. Для атрымання большых звестак глядзіце анлайн дапаможнік модуля <a href='@update'>Update manager</a>.

source: The User module allows users to register, log in, and log out. It also allows users with proper permissions to manage user roles (used to classify users) and permissions associated with those roles. For more information, see the online handbook entry for <a href="@user">User module</a>.
be: Модуль “ Карыстальнік” дазваляе карыстальнікам рэгістравацца, уваходзіць і выходзіць с сайта. Ён таксама дазваляе карыстальнікам з уласцівымі правамі кіраваць ролямі ( каб класіфікаваць карыстальнікаў) і правы злучаныя з тымі ролямі. Для падрабязнай інфармацыі глядзі анлайн даведнік па шляху <a href="@user">Модуль карыстальнік</a>.

source: The User module allows users with the appropriate <a href="@permissions">permissions</a> to create user accounts through the <a href="@people">People administration page</a>, where they can also assign users to one or more roles, and block or delete user accounts. If allowed, users without accounts (anonymous users) can create their own accounts on the <a href="@register">Create new account</a> page.
be: Модуль "Карыстальнік" дазваляе карыстальнікам з адпаведнымі правамі <a href="@permissions"> правы </a> саздавать акаўнты праз старонку адміністравання <a href="@people"> Старонка адміністравання </a>, дзе яны таксама могуць дадаць карыстальнікаў да адной, ці больш ралей і блокаў, ці выдаліць акаўнты карыстальнікаў. Калі дазволена, то карыстальнікі без акаўнта ( ананімныя карсытальнікі) могуць стварыць свой асабісты акаўнт на старонцы <a href="@register"> Стварыць новы акаўнт </a>.

source: The ability to send users their passwords in plain text has been removed in Drupal 7. Your existing email templates have been modified to remove it. You should <a href="@template-url">review these templates</a> to make sure they read properly.
be: Магчымасць дасылаць карыстальнікам іх паролі простым тэкстам была выдалена ў Drupal 7. Вашы існуючыя прыклады e-mail былі зменены, каб выдаліць гэтую функцыю. Вам патрэбна перайсці на <a href="@template-url">праглядзець гэтыя прыклады</a>, каб пераканацца, што яны працуюць належным чынам.

source: The absolute path to the file where @drupal data will be stored. This must be writable by the web server and should exist outside of the web root.
be: Абсалютны шлях да файла, у якім будуць захоўвацца дадзеныя @drupal. Гэта павінна быць папка, даступная для запісу вэб-серверам і не у галоўным дырэкторыі.

source: The access rule has been added.
be: Правіла дасягу было выдаленае.

source: The access rule has been deleted.
be: Правіла дасягу было выдаленае.

source: The access rule has been saved.
be: Правіла дасягу было захаванае.

source: The action has been successfully saved.
be: Дзеянне было паспяхова захаванае

source: The action you chose is already assigned to that trigger.
be: Дзеянне, якое вы абралі, ужо вызначана для гэтага трыгера.

source: The active search modules have been changed.
be: Актыўны модуль пошуку быў зменены.

source: The administrative email address for the site.
be: Адміністрацыйны адрас электроннай пошты на сайце.

source: The alias %alias is already in use in this language.
be: Псеўданім %alias ўжо выкарыстоўваецца на гэтай мове.

source: The alias has been deleted.
be: Аліас быў выдалены.

source: The alias has been saved.
be: Аліас быў захаваны.

source: The alias is already in use.
be: Аліас ужо выкарыстоўваецца.

source: The alt attribute may be used by search engines, screen readers, and when the image cannot be loaded.
be: Атрыбут alt можа выкарыстоўвацца пошукавымі рухавікамі, чытачамі экрану, і тады, калі малюнак не можа быць загружаны.

source: The answer you entered for the CAPTCHA was not correct.
be: Няправільны адказ на тэст.

source: The author of the comment, if they were logged in.
be: Аўтар каментару, калі яны аўтарызуюцца на сайце.

source: The author of the node.
be: Аўтар вузла.

source: The background color to use for exposed areas of the image. Use web-style hex colors (#FFFFFF for white, #000000 for black). Leave blank for transparency on image types that support it.
be: Колер фону для выкарыстоўвання ў адкрытых абласцях выявы. Выкарыстоўвайце вэб-стыль шаснаццатковых колераў (#FFFFFF для белага, #000000 для чорнага). Пакіньце пустым для вызначэння празрыстасці, калі тып выяў падтрымлівае празрыстасць.

source: The block %info was assigned to the invalid region %region and has been disabled.
be: Блок %info быў дададзены ў нядзейсны рэгіён %region і быў выключаны.

source: The block %name has been removed.
be: Блок %name выдалены.

source: The block cannot be placed in this region.
be: Блок не можа быць размешчаны ў гэтым рэгіёне.

source: The block configuration has been saved.
be: Наладкі блоку захаваныя.

source: The block has been created.
be: Блок быў створаны.

source: The block settings have been updated.
be: Наладкі блоку абноўленыя.

source: The book module offers a means to organize a collection of related content pages, collectively known as a book. When viewed, this content automatically displays links to adjacent book pages, providing a simple navigation system for creating and reviewing structured content.
be: Модуль Кніга дае сродкі для арганізацыі збору звязных старонак кантэнту, вядомых пад агульнай назвай - Кніга. Пры праглядванні, гэты кантэнт аўтаматычна адлюстроўвае спасылкі на суседнія старонкі кнігі, забяспечвае простай навігацыйнай сістэмай для стварэння і агляду структураванага кантэнту.

source: The book outline has been updated.
be: Рэзюмэ падшыўкі абноўленае.

source: The categories have been saved.
be: Катэгорыі захаваныя.

source: The category %category has been added.
be: Катэгорыя %category была даданая.

source: The category %category has been deleted.
be: Катэгорыя %category была выдаленая.

source: The category %category has been updated.
be: Катэгорыя %category была абноўленая.

source: The category the new field should be part of. Categories are used to group fields logically. An example category is "Personal information".
be: Катэгорыя, да якой будзе належыць новае поле. Катэгорыі выкарыстоўваюцца для лагічнай групоўкі палёў. Прыклад катэгорыі: "Асабістая інфармацыя".

source: The changes have been saved.
be: Змены былі захаваныя.

source: The changes to these blocks will not be saved until the <em>Save blocks</em> button is clicked.
be: Змены для гэтых блокаў будуць захаваныя толькі пасля таго як вы націсніце на кнопку <em>Захаваць блокі</em>

source: The character users will input to mark the decimal point in forms.
be: Сімвал, які карыстальнікі будуць уводзіць, каб адзначыць дзесятковую коску ў формах.

source: The clean URL test failed.
be: Тэст на чыстыя URL безпаспяховы.

source: The clean URL test passed.
be: Тэст на чыстыя URL пройдзены.

source: The combination of actions and triggers can perform many useful tasks, such as e-mailing an administrator if a user account is deleted, or automatically unpublishing comments that contain certain words. To set up a trigger/action combination, first visit the <a href="@actions-page">Actions configuration page</a>, where you can either verify that the action you want is already listed, or create a new <em>advanced</em> action. You will need to set up an advanced action if there are configuration options in your trigger/action combination, such as specifying an e-mail address or a list of banned words. After configuring or verifying your action, visit the <a href="@triggers-page">Triggers configuration page</a> and choose the appropriate tab (Comment, Taxonomy, etc.), where you can assign the action to run when the trigger event occurs.
be: Камбінацыя дзеянняў і трыгераў можа выконваць шмат карысных задач, такіх як адпраўка e-mail адміністратару, калі выдален акаўнт карыстальніка, альбо аўтаматычная забарона на публікацыю каментароў, якія ўтрымоўваюць пэўныя словы. Каб усталяваць трыгер/камбінацыю дзеянняў, прайдзіце спачатку па спасылцы <a href="@actions-page">Старонка наладжвання дзеянняў</a>, дзе вы таксама можаце праверыць, ці знаходзіцца патрэбнае вам дзеянне ў спісе, ці стварыць новае <em>пашыранае</em> дзеянне. Вам будзе патрэбна ўсталяваць пашыранае дзеянне калі ёсць наладкі кіравання ў вашым трыгеры/камбінацыі дзеянняў, такіх як задаваць e-mail, ці спіс забароненых словаў. Пасля наладжвання і праверкі вашых дзеянняў, перайдзіце па спасылцы <a href="@triggers-page">Старонка наладжвання трыгераў</a> і абярыце падыходную закладку ( Камянтар,Таксанамія, г.д.), дзе вы можаце абраць функцыі пры падзеях трыгера.

source: The comment and all its replies have been deleted.
be: Каментар ды ўсе адказы на яго выдаленыя.

source: The comment no longer exists.
be: Каментар болей не існуе.

source: The comment will be unpublished if it contains any of the phrases above. Use a case-sensitive, comma-separated list of phrases. Example: funny, bungee jumping, "Company, Inc."
be: Каментар не будзе апублікаваны, калі будзе ўтрымліваць любую вышэй адзначаную фразу. Выкарыстоўвайце рэгістра-залежныя і аддзеленыя коскай фразы ў спісе. Напрыклад: смешны, "Кампанія Х", прыгаючы амартызатар.

source: The comment you are replying to does not exist.
be: Каментар, на які Вы намагаецеся адказаць, болей не існуе

source: The comment's parent, if comment threading is active.
be: Каментар з'яўляецца бацькоўскім, калі дрэва каментараў актыўнае.

source: The comments have been deleted.
be: Каментары былі выдаленыя.

source: The configuration options have been reset to their default values.
be: Опцыі канфігурацыі ськінутыя да дапомных.

source: The configuration options have been saved.
be: Наладкі канфігурацыі захаваныя

source: The connection will be created between your web server and the machine hosting the web server files. In the vast majority of cases, this will be the same machine, and "localhost" is correct.
be: Злучэнне будзе створана паміж вэб-серверам і машынай хостынгу файлаў. У пераважнай большасці выпадкаў, гэта будзе той жа машыне, і "localhost" з'яўляецца правільным.

source: The contact form has not been configured. <a href="@add">Add one or more categories</a> to the form.
be: Кантактная форма не была наладжана. <a href="@add">Дадаць адну або некалькі катэгорыяў</a> у форме.

source: The content access permissions have been rebuilt.
be: 1 элемент быў пакінуты для індэксавання.Правы доступу да змесціва былі абноўлены.

source: The content access permissions have not been properly rebuilt.
be: Правы доступу да змесціва не былі абноўлены належным чынам.

source: The content access permissions need to be rebuilt.
be: Дазволы дасягу да змесціва неабходна перабудаваць зноў.

source: The content access permissions need to be rebuilt. <a href="@node_access_rebuild">Rebuild permissions</a>.
be: Дазволы дасягу да змесціва неабходна перабудаваць зноў. <a href="@node_access_rebuild">Перабудаваць дазволы</a>.

source: The content of the block as shown to the user.
be: Змест блоку як яго бачыць карыстальнік.

source: The content of this field is kept private and will not be shown publicly.
be: Змест гэтага поля не будзе паказаны публічна.

source: The content on this page has either been modified by another user, or you have already submitted modifications using this form. As a result, your changes cannot be saved.
be: Змесціва на гэтай странонцы таксама было зменена іншым карыстальнікам, ці вы ужо зацвердзілі змяненні, выкарыстоўваючы гэту форму. У вынніку, вашы змены не могуць быць захаваны.

source: The content type %name has been added.
be: Тып змесціва %name быў даданы.

source: The content type %name has been deleted.
be: Змесціва тыпа %name было выдалена

source: The content type %name has been updated.
be: Тып змесціва %name быў абноўлены.

source: The content type %rowtype had uploads disabled but contained uploaded file data. Uploads have been re-enabled to migrate the existing data. You may delete the "File attachments" field in the %rowtype type if this data is not necessary.
be: У тыпе змесціва %rowtype былі адключаны загрузкі, але ён ўтрымліваў загружаныя файлавыя дадзеныя. Загрузкі былі перадазволеныя, для перасялення існуючых дадзеных. Вы можаце выдаліць "Прышчэпленыя файлы" ў тыпе %rowtype, калі гэтыя дадзеныя непатрэбны.

source: The content type for the %add-child link must be one of those selected as an allowed book outline type.
be: Тып змесціва для %add-дачыннай спасылкі павінен быць абраны ў якасці дазволеннага тыпу схемы кнігі.

source: The content will be unpublished if it contains any of the phrases above. Use a case-sensitive, comma-separated list of phrases. Example: funny, bungee jumping, "Company, Inc."
be: Змесціва не будзе апублікавана, калі будзе ўтрымліваць любую вышэй адзначаную фразу. Выкарыстоўвайце рэгістра-залежныя і аддзеленыя коскай фразы ў спісе. Напрыклад: смешны, "Кампанія Х", прыгаючы амартызатар.

source: The custom favicon path is invalid.
be: Маршрут уласнага значка няправільны.

source: The custom logo path is invalid.
be: Маршрут уласнага лагатыпу няправільны.

source: The custom menu %title has been deleted.
be: Дапасаванае меню %title было выдалена.

source: The data could not be saved because the destination %destination is invalid. This may be caused by improper use of file_save_data() or a missing stream wrapper.
be: Дадзеныя не могуць быць захаваныя, таму што канчатковы шлях %destination няправільны. Прычынай гэтага можа быць няправільнае выкарыстанне функцыі file_save_data() ці прапушчана цякучая абгортка.

source: The data could not be saved, because the destination is invalid. More information is available in the system log.
be: Дадзеныя не могуць быць захаваныя, таму што прызначэнне з'яўляецца памылковым. Дадатковая інфармацыя даступная ў сістэмным журнале.

source: The database table prefix you have entered, %db_prefix, is invalid. The table prefix can only contain alphanumeric characters, periods, or underscores.
be: Прэфікс табліцы %db_prefix мае няправільны фармат. Прэфікс можа ўтрымліваць толькі лічбы, літары, прабелы і знакі падкрэслівання (underscore).

source: The database table prefix you have entered, %prefix, is invalid. The table prefix can only contain alphanumeric characters, periods, or underscores.
be: Уведзены вамі прэфікс табліцы базы дадзеных %prefix няправільны. Прэфікс табліцы можа змяшчаць толькі лічбы, літары, кропкі альбо падкрэсліванні.

source: The database version %version is less than the minimum required version %minimum_version.
be: Версія базы дадзеных %version менш, чым неабходны мінімум версіі %minimum_version.

source: The date on which a visitor last read the node.
be: Апошняя дата, калі наведвальнік сайта чытаў вузел.

source: The date the comment was most recently updated.
be: Дата апошняга рэдагавання каментара.

source: The date the comment was posted.
be: Дата стварэння каментара.
